<?php
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
{
$permissions = [
// صفحة القيادة
'صفحة القيادة',
    'عدد الفواتير',
    'المبيعات',
    'الاجيل',
    'مرتجع',
    'مرتجع من حساب',
    'فواتير الشراء',
    'المشتريات',
    'مشتريات أجل',
    'مرتجع مشتريات',
    'مرتجع مشتريات اجل',
    'المصروفات',
    'التوريد',
    'الصرف',
    'الخزينة',
    'البحث',

// صفحة المبيعات
'صفحة المبيعات',
    'حذف فاتورة مبيعات',
    'بحث فاتورة مبيعات',
    'سعر المنتج مبيعات',
    'الخصم علي المنتج',
    'خصم علي فاتورة مبيعات',

// صفحة المبيعات
'صفحة الهالك',
    'حذف فاتورة هالك',
    'بحث فاتورة هالك',
    'سعر المنتج هالك',
    'الخصم علي هالك',
    'خصم علي فاتورة هالك',

// صفحة المشتريات
'صفحة المشتريات',
    'حذف فاتورة مشتريات',
    'بحث فاتورة مشتريات',
    'سعر البيع القطاعي',
    'سعر البيع الجملة',
    'سعر الشراء',
    'الخصم علي منتج فاتورة مشتريات',
    'خصم علي فاتورة مشتريات',
// صفحة المنتجات والاصناف والوحدات
'صفحة المنتجات والاصناف والوحدات',
    'المنتجات',
        'إضافة منتج',
        'إضافة تسعيرة',
        'تصدير منتجات',
        'استراد منتجات',
        'بحث منتجات',
        'تعديل منتج',
        'حذف منتج',
        'الخصم منتجات',
        'الهالك منتجات',
    'صفحة الاصناف',
        'إضافة صنف',
        'بحث صنف',
        'تعديل صنف',
        'خصم صنف',
        'حذف صنف',
    'صفحة الوحدات',
        'إضافة وحدة',
        'بحث وحدة',
        'تعديل وحدة',
        'مسح وحدة',
// صفحة والتوريد
'صفحة الصرف والتوريد',
    'صفحة الصرف',
        'البحث صرف',
        'إذن صرف',
        'حذف صرف',
    'صفحة التوريد',
        'البحث توريد',
        'إذن توريد',
        'حذف توريد',
// صفحة الموظفين
'صفحة الموظفين',
    'الحضور والانصراف',
    'إضافة موظف',
    'تعديل موظف',
    'حذف موظف',
    'السلف والخصم',
    'بحث عن موظق',
// صفحة العملاء
'صفحة العملاء',
    'إضافة عميل',
    'تعديل عميل',
    'حذف عميل',
    'بحث عن عميل',
// صفحة المصروفات
'صفحة المصروفات',
    'إضافة مصروف',
    'إضافة مصروف جديد',
    'حذف مصروف',
    'تعديل مصروف',
    'بحث عن مصروف',
// صفحة الاعدادات
'صفحة الاعدادات',
    'صفحة النظام',


// صفحة المستخدمين
'صفحة المستخدمين والصلاحيات',
    'صفحة المستخدمين ',
    'صفحة الصلاحيات ',

// صفحة التقارير
'صفحة التقارير',
    'تقارير المبيعات ',
        'excel مبيعات',
        'pdf مبيعات',
        'بحث تقارير مبيعات',
        'طباعة تقارير مبيعات',

    'تقارير المشتريات',
        'excel مشتريات',
        'pdf مشتريات',
        'بحث تقارير المشتريات',
        'طباعة تقارير المشتريات',

    'تقارير الصرف',
        'excel الصرف',
        'pdf الصرف',
        'بحث تقارير الصرف',
        'طباعة تقارير الصرف',

    'تقارير التوريد',
        'excel التوريد',
        'pdf التوريد',
        'بحث تقارير التوريد',
        'طباعة تقارير التوريد',

     'تقارير المصروفات',
        'excel المصروفات',
        'pdf المصروفات',
        'بحث تقارير المصروفات',
        'طباعة تقارير المصروفات',
// الصلاحيات
'role-list',
'role-create',
'role-edit',
'role-delete',
];
    foreach ($permissions as $permission) {
        Permission::create(['name' => $permission]);
    }
}
}